dependencies/we_envs/说明.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-28 一 10:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="fhln" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org91d72d4">1. 如何安装</a>
<ul>
<li><a href="#orgba0c449">1.1. 测试</a></li>
</ul>
</li>
<li><a href="#org219b8d4">2. 自定义 mujoco 环境</a></li>
<li><a href="#orge648d8e">3. 环境定义</a>
<ul>
<li><a href="#org3b202eb">3.1. we_UR5ePush-v2</a></li>
<li><a href="#org6dc6c30">3.2. we_UR5ePushDense-v2</a></li>
<li><a href="#org402896d">3.3. We_UR5eShadowLite-v2</a>
<ul>
<li><a href="#orgefdd98b">3.3.1. action</a></li>
<li><a href="#orga1ee49c">3.3.2. obs</a></li>
<li><a href="#orgf78c7e4">3.3.3. done</a></li>
<li><a href="#orgd190ff5">3.3.4. reward</a></li>
<li><a href="#org98e1d39">3.3.5. info</a></li>
<li><a href="#org88dc1b6">3.3.6. 示例</a></li>
</ul>
</li>
<li><a href="#orgfc95964">3.4. Adroit-door-v0</a></li>
<li><a href="#org5e3903a">3.5. Adroit-hammer-v0</a></li>
<li><a href="#org8d0066b">3.6. Adroit-pen-v0</a></li>
<li><a href="#org569a81f">3.7. Adroit-relocate-v0</a></li>
</ul>
</li>
<li><a href="#org15ac814">4. 手柄遥控示教</a>
<ul>
<li><a href="#orgf5fc291">4.1. 测试</a></li>
</ul>
</li>
<li><a href="#org6d7c034">5. bug</a></li>
</ul>
</div>
</div>
<div id="outline-container-org91d72d4" class="outline-2">
<h2 id="org91d72d4"><span class="section-number-2">1</span> 如何安装</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>安装 mujoco200</li>
<li>安装 we_envs,如果 pip 版本的 mujoco_py 安装不上，从源码安装 mujoco-py-2.0.2.2,从 github 上下载 mujoco-py2.0.2.2</li>
</ol>
<div class="org-src-container">
<pre class="src src-sh">conda activate xxxx
<span style="color: #4f97d7;">cd</span> we_envs
pip install -e .
</pre>
</div>
</div>
<div id="outline-container-orgba0c449" class="outline-3">
<h3 id="orgba0c449"><span class="section-number-3">1.1</span> 测试</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh">python test_envs/test_keyboard.py
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org219b8d4" class="outline-2">
<h2 id="org219b8d4"><span class="section-number-2">2</span> 自定义 mujoco 环境</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>如果要编写自定义环境，修改 mujoco_env.py、hand_manipulation_suite/xxx.py，然后在 hand_manipulation_suite/__init__.py 中根据格式注册即可。</li>
<li><p>
调用时，建立 gym 环境，用 unwrapped 获取到环境中的多种信息
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">env</span> = gym.make<span style="color: #4f97d7;">(</span>env_name<span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">env_unwrap</span> = env.unwrapped <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#25286;&#21253;&#29615;&#22659;&#65292;&#33021;&#22815;&#35843;&#29992;&#26356;&#22810;&#20869;&#32622;&#20989;&#25968;&#65292;&#19981;&#20165;&#20165;&#26159; step</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orge648d8e" class="outline-2">
<h2 id="orge648d8e"><span class="section-number-2">3</span> 环境定义</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3b202eb" class="outline-3">
<h3 id="org3b202eb"><span class="section-number-3">3.1</span> we_UR5ePush-v2</h3>
<div class="outline-text-3" id="text-3-1">
<p>
稀疏奖励推箱子。奖励只有到达终点才出现,手爪朝向固定一直垂直向下。
</p>
</div>
</div>
<div id="outline-container-org6dc6c30" class="outline-3">
<h3 id="org6dc6c30"><span class="section-number-3">3.2</span> we_UR5ePushDense-v2</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>稠密奖励版本推箱子。奖励跟距离呈负相关。</li>
</ul>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">obs</span> = np.concatenate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">[</span>
       grip_pos,  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#25163;&#29226;&#20301;&#32622;&#65292;3 &#32500;</span>
       object_pos.ravel<span style="color: #2d9574;">()</span>, <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#29289;&#20307;&#20301;&#32622;&#65292;3</span>
       object_rel_pos.ravel<span style="color: #2d9574;">()</span>,  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#29289;&#20307;&#30456;&#23545;&#25163;&#29226;&#30340;&#20301;&#32622;,3</span>
       object_rot.ravel<span style="color: #2d9574;">()</span>, <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#29289;&#20307;&#26059;&#36716;&#27431;&#25289;&#35282;,3</span>
       grip_velp,  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25163;&#29226;&#22312;&#19990;&#30028;&#22352;&#26631;&#31995;&#19979;&#30340;&#36895;&#24230;,3</span>
       goal_distance.ravel<span style="color: #2d9574;">&#65288;&#65289;</span>, <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#29289;&#20307;&#21644;&#30446;&#26631;&#28857;&#30340;&#36317;&#31163;&#30690;&#37327;&#65292;3           </span>
   <span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org402896d" class="outline-3">
<h3 id="org402896d"><span class="section-number-3">3.3</span> We_UR5eShadowLite-v2</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>shadow 四指手+ur5e 机械臂操作键盘，参考 test_envs/test_joy/joy_telemanipulation.py。</li>
<li>shadow 手关节定义参考 ShadowHand_define.pdf</li>
<li><p>
step 函数返回四元组
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">obs</span>, <span style="color: #7590db;">reward</span>, <span style="color: #7590db;">done</span>, <span style="color: #7590db;">info</span> = env.step<span style="color: #4f97d7;">(</span>action<span style="color: #4f97d7;">)</span>  
</pre>
</div></li>
</ul>
</div>
<div id="outline-container-orgefdd98b" class="outline-4">
<h4 id="orgefdd98b"><span class="section-number-4">3.3.1</span> action</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
action 是一个 19 维数组，包含机械臂的末端坐标 ee_position_angle 和灵巧手关节角度 hand_ctrl。
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">action</span> = <span style="color: #4f97d7;">[</span>ee_position_angle, hand_ctrl<span style="color: #4f97d7;">]</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">ee_position_angle =[px, py, pz, rx, ry, rz]</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">hand_ctrl = [FF4, FF3, FF21, MF4, MF3, MF21, RF4, RF3, RF21, TH5, TH4, TH2, TH1]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga1ee49c" class="outline-4">
<h4 id="orga1ee49c"><span class="section-number-4">3.3.2</span> obs</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
obs 是一个 dict，包含 obs['achieved_goal'], obs['observation'], obs['desired_goal'.]
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">obs</span><span style="color: #4f97d7;">[</span><span style="color: #2d9574;">'observation'</span><span style="color: #4f97d7;">]</span> = np.concatenate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">[</span>
         hand_pos, <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26426;&#26800;&#33218;&#26411;&#31471;&#20301;&#32622;&#65292;3 &#32500;</span>
         hand_quat, <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26426;&#26800;&#33218;&#26411;&#31471;&#26397;&#21521;&#22235;&#20803;&#25968;,4</span>
         hand_velp, <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#28789;&#24039;&#25163;&#26411;&#31471;&#32447;&#36895;&#24230;&#65292;3</span>
         finger_pos_data, <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20851;&#33410;&#35282;&#24230;&#20540; [FF4, FF3, FF2, FF1, MF4, MF3, MF2, MF1, RF4, RF3, RF2, RF1, TH5, TH4, TH2, TH1]&#65292;16</span>
         finger_pressure_data  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25351;&#23574;&#21387;&#21147;&#20540; Ffinger, Mfinger, Rfinger, Thumb&#65292;4</span>
     <span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">obs</span><span style="color: #4f97d7;">[</span><span style="color: #2d9574;">'achieved_goal'</span><span style="color: #4f97d7;">]</span>=<span style="color: #4f97d7; font-weight: bold;">self</span>.achived_goal <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#24050;&#32463;&#25171;&#20986;&#26469;&#30340;&#23383;&#65292;&#32500;&#24230;&#19981;&#23450;</span>
<span style="color: #7590db;">obs</span><span style="color: #4f97d7;">[</span><span style="color: #2d9574;">'desired_goal'</span><span style="color: #4f97d7;">]</span>= <span style="color: #4f97d7; font-weight: bold;">self</span>.goal <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#30446;&#26631;&#23383;&#31526;,&#32500;&#24230;&#19981;&#23450;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf78c7e4" class="outline-4">
<h4 id="orgf78c7e4"><span class="section-number-4">3.3.3</span> done</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
done 表示任务是否完成
</p>
</div>
</div>
<div id="outline-container-orgd190ff5" class="outline-4">
<h4 id="orgd190ff5"><span class="section-number-4">3.3.4</span> reward</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
reward 暂定稀疏奖励，未到目标 r=-1,到达目标 r=0。参见 ur5eShadowLite_env.py 中 compute_reward 函数
</p>
</div>
</div>
<div id="outline-container-org98e1d39" class="outline-4">
<h4 id="org98e1d39"><span class="section-number-4">3.3.5</span> info</h4>
<div class="outline-text-4" id="text-3-3-5">
<ul class="org-ul">
<li>info['early_abort'] 包含终止。如果打出来的字已经不是目标的字，可以考虑直接 reset。</li>
<li>info['dangerous']表示是否危险状态。当末端六维力传感器值超过阈值时，认为跟环境接触力太大，可以提前停止。</li>
</ul>
</div>
</div>
<div id="outline-container-org88dc1b6" class="outline-4">
<h4 id="org88dc1b6"><span class="section-number-4">3.3.6</span> 示例</h4>
<div class="outline-text-4" id="text-3-3-6">
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #7590db;">o</span> = env.reset<span style="color: #4f97d7;">()</span>
    <span style="color: #7590db;">o</span> = o<span style="color: #4f97d7;">[</span><span style="color: #2d9574;">'observation'</span><span style="color: #4f97d7;">]</span>
    env.set_goal<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">'s'</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20808;&#35774;&#32622;&#20010;&#22266;&#23450;&#30446;&#26631;&#20540;&#20026;&#23383;&#31526; s</span>
    <span style="color: #4f97d7; font-weight: bold;">try</span>:
    <span style="color: #7590db;">a</span>=policy<span style="color: #4f97d7;">(</span>o<span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">a</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">0</span>:<span style="color: #a45bad;">3</span><span style="color: #4f97d7;">]</span> = np.clip<span style="color: #4f97d7;">(</span>a<span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">0</span>:<span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">]</span>, -<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">01</span>, <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">01</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20445;&#35777; xyz &#20301;&#32622;&#23433;&#20840;&#20540;&#65292;</span>
    <span style="color: #7590db;">a</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">3</span>:<span style="color: #a45bad;">6</span><span style="color: #4f97d7;">]</span> = np.clip<span style="color: #4f97d7;">(</span>a<span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">3</span>:<span style="color: #a45bad;">6</span><span style="color: #bc6ec5;">]</span>, -<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20445;&#35777;&#27431;&#25289;&#35282;&#23433;&#20840;&#20540;</span>

    <span style="color: #7590db;">o</span>, <span style="color: #7590db;">r</span>, <span style="color: #7590db;">d</span>, <span style="color: #7590db;">info</span> = env.step<span style="color: #4f97d7;">(</span>a<span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">o</span> = o<span style="color: #4f97d7;">[</span><span style="color: #2d9574;">'observation'</span><span style="color: #4f97d7;">]</span>
<span style="color: #4f97d7; font-weight: bold;">except</span>:
    <span style="color: #7590db;">done</span> = <span style="color: #a45bad;">True</span>
    <span style="color: #7590db;">r</span> = r-<span style="color: #a45bad;">1500</span>.<span style="color: #a45bad;">0</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#30001;&#20110;&#39537;&#21160;&#21147;&#22826;&#22823;&#23548;&#33268; mujoco &#35299;&#31639;&#22833;&#36133;&#65292;&#20445;&#25252;&#24615;&#20572;&#27490;</span>
<span style="color: #4f97d7; font-weight: bold;">finally</span>:

    <span style="color: #7590db;">early_abort</span> = info<span style="color: #4f97d7;">[</span><span style="color: #2d9574;">'early_abort'</span><span style="color: #4f97d7;">]</span> <span style="color: #4f97d7; font-weight: bold;">or</span> info<span style="color: #4f97d7;">[</span><span style="color: #2d9574;">'dangerous'</span><span style="color: #4f97d7;">]</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> early_abort:
        <span style="color: #7590db;">r</span> = r-<span style="color: #a45bad;">2300</span>.<span style="color: #a45bad;">0</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> d:
        <span style="color: #7590db;">r</span> = r+<span style="color: #a45bad;">4400</span>.<span style="color: #a45bad;">0</span>
    <span style="color: #7590db;">done</span> = d <span style="color: #4f97d7; font-weight: bold;">or</span> early_abort
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfc95964" class="outline-3">
<h3 id="orgfc95964"><span class="section-number-3">3.4</span> Adroit-door-v0</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>adroit 手来开门环境，详见 <a href="https://github.com/vikashplus/mj_envs">mj_envs</a>。</li>
</ul>
</div>
</div>
<div id="outline-container-org5e3903a" class="outline-3">
<h3 id="org5e3903a"><span class="section-number-3">3.5</span> Adroit-hammer-v0</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>adroit 手敲钉子。</li>
</ul>
</div>
</div>
<div id="outline-container-org8d0066b" class="outline-3">
<h3 id="org8d0066b"><span class="section-number-3">3.6</span> Adroit-pen-v0</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>adroit 手转笔。</li>
</ul>
</div>
</div>
<div id="outline-container-org569a81f" class="outline-3">
<h3 id="org569a81f"><span class="section-number-3">3.7</span> Adroit-relocate-v0</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li>adroit 手抓放物体。</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org15ac814" class="outline-2">
<h2 id="org15ac814"><span class="section-number-2">4</span> 手柄遥控示教</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sh">rosrun joy joy_node
python test_envs/test_joy/jog_publisher.py
python test_envs/test_joy/joy_telemanipulation.py
</pre>
</div>
</div>
<div id="outline-container-orgf5fc291" class="outline-3">
<h3 id="orgf5fc291"><span class="section-number-3">4.1</span> 测试</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-sh">python test_env.py
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6d7c034" class="outline-2">
<h2 id="org6d7c034"><span class="section-number-2">5</span> bug</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Pycharm 有时会找不到指定模块，把相应模块所在目录设置成 Source Root 即可。 在目录上右击-Mark direcotory as-Source Root。</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: fhln</p>
<p class="date">Created: 2019-10-28 一 10:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
